# SelectTextOnFocus Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextBox..::..SelectTextOnFocus Property
TextBox Class See Also
---
A value that indicates if the text is selected when the text box gains focus.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool SelectTextOnFocus { get; set; }
```

Visual Basic
---
```text
Public Property SelectTextOnFocus As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SelectTextOnFocus {
	bool get ();
	void set (bool value);
}
```

# Remarks
If the value is true all the text in the text box will be selected when the text box gets keyboard focus. If it is false the text is not selected. The default value is false.
# See Also
TextBox Class
Autodesk.Revit.UI Namespace